<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Recipe description</string>
	<key>Identifier</key>
	<string>com.github.iancohn.download.DellSupportAssist-Win64</string>
	<key>Input</key>
	<dict>
		<key>POPULATE_CVES</key>
		<true/>
		<key>OS_CODE</key>
		<string>WT64A</string>
		<key>CATEGORY</key>
		<string>AP</string>
		<key>FILE_TYPE</key>
		<string>LWXP</string>
		<key>DRIVER_NAME_RE_PATTERN</key>
		<string>SupportAssist</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict/>
			<key>Processor</key>
			<string>com.github.iancohn.SharedProcessors/DellSoftwareUrlProvider</string>
		</dict>
	</array>
</dict>
</plist>
