<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest source of SeleniumEngine, create a package and install it.</string>
    <key>Identifier</key>
    <string>com.github.iancohn.install.SeleniumEngine</string>
    <key>Input</key>
    <dict/>
    <key>MinimumVersion</key>
    <string>2.0.0</string>
    <key>ParentRecipe</key>
    <string>com.github.iancohn.pkg.SeleniumEngine</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>Installer</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pkg_path%</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
