<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest source of SeleniumEngine.</string>
    <key>Identifier</key>
    <string>com.github.iancohn.download.SeleniumEngine</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>SeleniumEngine</string>
        <key>DOWNLOAD_URL</key>
        <string>https://www.github.com/iancohn/SeleniumEngine/-/archive/main/SeleniumEngine-main.zip</string>
        <key>GoogleChromeDmgUrl</key>
        <string>https://dl.google.com/chrome/mac/universal/stable/GGRO/googlechrome.dmg</string>
        <key>ChromeWebDriverUrl</key>
        <string></string>
    </dict>
    <key>MinimumVersion</key>
    <string>2.0.0</string>
    <key>Process</key>
    <array>
      <dict>
        <key>Processor</key>
        <string>URLDownloader</string>
        <key>Arguments</key>
        <dict>
          <key>url</key>
          <string>%GoogleChromeDmgUrl%</string>
          <key>filename</key>
          <string>GoogleChrome.dmg</string>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>AppDmgVersioner</string>
        <key>Arguments</key>
        <dict>
          <key>dmg_path</key>
          <string>%pathname%</string>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>URLTextSearcher</string>
        <key>Arguments</key>
        <dict>
          <key>url</key>
          <string>https://chromedriver.storage.googleapis.com/LATEST_RELEASE</string>
          <key>re_pattern</key>
          <string>[\d\.]*</string>
        </dict>
      </dict>
      <dict>
          <key>Processor</key>
          <string>URLDownloader</string>
          <key>Arguments</key>
          <dict>
            <key>url</key>
            <string>https://chromedriver.storage.googleapis.com/%match%/chromedriver_mac64.zip</string>
            <key>filename</key>
            <string>chromedriver.zip</string>
          </dict>
      </dict>
      <dict>
          <key>Processor</key>
          <string>URLDownloader</string>
          <key>Arguments</key>
          <dict>
              <key>url</key>
              <string>%DOWNLOAD_URL%</string>
              <key>filename</key>
              <string>%NAME%.zip</string>
          </dict>
      </dict>
      <dict>
          <key>Processor</key>
          <string>EndOfCheckPhase</string>
      </dict>
    </array>
</dict>
</plist>
