<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest source of SeleniumEngine.</string>
    <key>Identifier</key>
    <string>com.github.iancohn.pkg.SeleniumEngine</string>
    <key>Input</key>
    <dict/>
    <key>MinimumVersion</key>
    <string>2.0.0</string>
    <key>ParentRecipe</key>
    <string>com.github.iancohn.download.SeleniumEngine</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>Unarchiver</string>
            <key>Arguments</key>
            <dict>
                <key>archive_path</key>
                <string>%pathname%</string>
                <key>purge_destination</key>
                <string>True</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/SeleniumEngine-Source</string>
                <key>archive_format</key>
                <string>zip</string>
            </dict>
        </dict>
        <dict>
          <key>Processor</key>
          <string>URLTextSearcher</string>
          <key>Arguments</key>
          <dict>
              <key>url</key>
              <string>https://raw.githubusercontent.com/iancohn/SeleniumEngine/main/versions.txt</string>
              <key>re_pattern</key>
              <string><![CDATA[__version__\=\s?(?P<engine_version>[0-9\.]+)\s?]]></string>
          </dict>
        </dict>
        <dict>
          <key>Comment</key>
          <string>Create a pkg root; we'll extract things from the zip file here.</string>
          <key>Processor</key>
          <string>PkgRootCreator</string>
          <key>Arguments</key>
          <dict>
              <key>pkgroot</key>
              <string>%RECIPE_CACHE_DIR%/SeleniumEngine</string>
              <key>pkgdirs</key>
              <dict>
                  <key>Library</key>
                  <string>01775</string>
                  <key>Library/AutoPkg</key>
                  <string>0775</string>
                  <!-- <key>Library/AutoPkg/autopkglib</key>
                  <string>0775</string> -->
                  <key>Library/AutoPkg/Python3</key>
                  <string>0775</string>
                  <key>Library/AutoPkg/Python3/Python.framework</key>
                  <string>0775</string>
                  <key>Library/AutoPkg/Python3/Python.framework/Versions</key>
                  <string>0775</string>
                  <key>Library/AutoPkg/Python3/Python.framework/Versions/Current</key>
                  <string>0775</string>
                  <key>Library/AutoPkg/Python3/Python.framework/Versions/Current/lib</key>
                  <string>0775</string>
                  <key>Library/AutoPkg/Python3/Python.framework/Versions/Current/lib/python3.7</key>
                  <string>0775</string>
                  <key>Library/AutoPkg/Python3/Python.framework/Versions/Current/lib/python3.7/site-packages</key>
                  <string>0775</string>
                  <key>Library/AutoPkg/SeleniumEngine</key>
                  <string>0775</string>
                  <key>Library/AutoPkg/SeleniumEngine/bin</key>
                  <string>0775</string>
              </dict>
            </dict>
      </dict>
      <dict>
          <key>Comment</key>
          <string>Copy Selenium module to new pkgroot</string>
          <key>Processor</key>
          <string>Copier</string>
          <key>Arguments</key>
          <dict>
              <key>source_path</key>
              <string>%RECIPE_CACHE_DIR%/SeleniumEngine-Source/SeleniumEngine-main/modules/selenium/</string>
              <key>destination_path</key>
              <string>%pkgroot%/Library/AutoPkg/Python3/Python.framework/Versions/Current/lib/python3.7/site-packages/selenium/</string>
          </dict>
      </dict>
      <dict>
          <key>Processor</key>
          <string>PathDeleter</string>
          <key>Arguments</key>
          <dict>
              <key>path_list</key>
              <array>
                  <string>%RECIPE_CACHE_DIR%/SeleniumEngine-Source/SeleniumEngine-main/modules</string>
                  <string>%RECIPE_CACHE_DIR%/SeleniumEngine-Source/SeleniumEngine-main/README.md</string>
                  <string>%RECIPE_CACHE_DIR%/SeleniumEngine-Source/SeleniumEngine-main/versions.txt</string>
                  <string>%RECIPE_CACHE_DIR%/SeleniumEngine-Source/SeleniumEngine-main/.gitignore</string>
                  <string>%RECIPE_CACHE_DIR%/SeleniumEngine-Source/SeleniumEngine-main/docs/</string>
              </array>
          </dict>
      </dict>
      <dict>
          <key>Comment</key>
          <string>Copy SeleniumEngine module to new pkgroot</string>
          <key>Processor</key>
          <string>Copier</string>
          <key>Arguments</key>
          <dict>
              <key>source_path</key>
              <string>%RECIPE_CACHE_DIR%/SeleniumEngine-Source/SeleniumEngine-main/</string>
              <key>destination_path</key>
              <string>%pkgroot%/Library/AutoPkg/autopkglib</string>
          </dict>
      </dict>
      <dict>
        <key>Comment</key>
        <string>Extract the Chrome Web Driver</string>
        <key>Processor</key>
        <string>Unarchiver</string>
        <key>Arguments</key>
        <dict>
          <key>archive_path</key>
          <string>%RECIPE_CACHE_DIR%/downloads/chromedriver.zip</string>
          <key>destination_path</key>
          <string>%pkgroot%/Library/AutoPkg/SeleniumEngine/bin/</string>
          <key>purge_destination</key>
          <true/>
        </dict>
      </dict>
      <dict>
        <key>Comment</key>
        <string>Copy the Chrome .app</string>
        <key>Processor</key>
        <string>Copier</string>
        <key>Arguments</key>
        <dict>
          <key>source_path</key>
          <string>%RECIPE_CACHE_DIR%/downloads/GoogleChrome.dmg/Google Chrome.app</string>
          <key>destination_path</key>
          <string>%pkgroot%/Library/AutoPkg/SeleniumEngine/bin/Google Chrome.app</string>
          <key>overwrite</key>
          <true/>
        </dict>
      </dict>
      <dict>
          <key>Comment</key>
          <string>Make PackageInfo file for our package</string>
          <key>Processor</key>
          <string>PkgInfoCreator</string>
          <key>Arguments</key>
          <dict>
              <key>version</key>
              <string>%engine_version%</string>
              <key>template_path</key>
              <string>SeleniumPkgInfoTemplate</string>
              <key>infofile</key>
              <string>%RECIPE_CACHE_DIR%/PackageInfo</string>
              <key>pkgtype</key>
              <string>flat</string>
          </dict>
      </dict>
      <dict>
          <key>Comment</key>
          <string>Finally! Build an Apple package.</string>
          <key>Processor</key>
          <string>PkgCreator</string>
          <key>Arguments</key>
          <dict>
              <key>pkg_request</key>
              <dict>
                  <key>version</key>
                  <string>%engine_version%</string>
                  <key>pkgname</key>
                  <string>SeleniumEngine-%engine_version%</string>
                  <key>pkgdir</key>
                  <string>%RECIPE_CACHE_DIR%/</string>
                  <key>id</key>
                  <string>com.github.iancohn.pkg.SeleniumEngine</string>
                  <key>options</key>
                  <string>purge_ds_store</string>
                  <key>chown</key>
                  <array>
                      <dict>
                          <key>path</key>
                          <string>Library</string>
                          <key>user</key>
                          <string>root</string>
                          <key>group</key>
                          <string>admin</string>
                      </dict>
                  </array>
              </dict>
          </dict>
      </dict>
      <dict>
          <key>Processor</key>
          <string>PathDeleter</string>
          <key>Arguments</key>
          <dict>
              <key>path_list</key>
              <array>
                  <string>%RECIPE_CACHE_DIR%/SeleniumEngine/</string>
                  <string>%RECIPE_CACHE_DIR%/SeleniumEngine-Source/</string>
              </array>
          </dict>
      </dict>
      <dict>
          <key>Processor</key>
          <string>EndOfCheckPhase</string>
      </dict>
    </array>
</dict>
</plist>
