<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest source of SeleniumEngine.</string>
    <key>Identifier</key>
    <string>com.github.iancohn.download.SeleniumEngine</string>
    <key>Input</key>
    <dict/>
    <key>MinimumVersion</key>
    <string>2.0.0</string>
    <key>Process</key>
    <array>
      <dict>
        <key>Processor</key>
        <string>URLDownloader</string>
        <key>Arguments</key>
        <dict>
          <key>url</key>
          <string>https://dl.google.com/chrome/mac/universal/stable/GGRO/googlechrome.dmg</string>
          <key>filename</key>
          <string>GoogleChrome.dmg</string>
        </dict>
      </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/Google Chrome.app</string>
                <key>strict_verification</key>
                <false/>
                <key>requirement</key>
                <string>(identifier "com.google.Chrome" or identifier "com.google.Chrome.beta" or identifier "com.google.Chrome.dev" or identifier "com.google.Chrome.canary") and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = EQHXZ8M8AV</string>
            </dict>
        </dict>
      <dict>
        <key>Processor</key>
        <string>AppDmgVersioner</string>
        <key>Arguments</key>
        <dict>
          <key>dmg_path</key>
          <string>%pathname%</string>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>URLTextSearcher</string>
        <key>Arguments</key>
        <dict>
          <key>url</key>
          <string>https://chromedriver.storage.googleapis.com/LATEST_RELEASE</string>
          <key>re_pattern</key>
          <string>[\d\.]*</string>
        </dict>
      </dict>
      <dict>
          <key>Processor</key>
          <string>URLDownloader</string>
          <key>Arguments</key>
          <dict>
            <key>url</key>
            <string>https://chromedriver.storage.googleapis.com/%match%/chromedriver_mac64.zip</string>
            <key>filename</key>
            <string>chromedriver.zip</string>
          </dict>
      </dict>
      <dict>
          <key>Processor</key>
          <string>URLDownloader</string>
          <key>Arguments</key>
          <dict>
              <key>url</key>
              <string>https://github.com/iancohn/SeleniumEngine/archive/refs/heads/main.zip</string>
              <key>filename</key>
              <string>SeleniumEngine.zip</string>
          </dict>
      </dict>
      <dict>
          <key>Processor</key>
          <string>EndOfCheckPhase</string>
      </dict>
    </array>
</dict>
</plist>
